Revit 2027 API
ScheduleDefinition.GetFieldIndex Method
 Converts a field ID to the corresponding field index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetFieldIndex(
	ScheduleFieldId fieldId
)
Public Function GetFieldIndex (
	fieldId As ScheduleFieldId
) As Integer
public:
int GetFieldIndex(
	ScheduleFieldId^ fieldId
)
member GetFieldIndex :
        fieldId : ScheduleFieldId -> int
Parameters
fieldId ScheduleFieldId
 The field ID.
Return Value
Int32
 The field index.
Exceptions
Exception | Condition
ArgumentException |  fieldId is not the ID of a field in this ScheduleDefinition.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace